<?
  // 연산자 - 비교연산자
  $num = 10;
  echo $num == 10; // == 같다 연산자 우항과 좌항이 같은 값이면 참(true) 1이 반환된다. 다른 값이면 가짓(false) 반환되는게 없다.
  echo "<br/>";
  echo $num == 11;
  echo "<br/>";
  echo $num != 10; // != 다르다 연산자 우항과 좌항이 다른 값이면 참(true) 1이 반환된다. 같은 값이면 가짓(false) 반환되는게 없다.
  echo "<br/>";
  echo $num != 11;
  echo "<br/>";
  echo $num > 9; // > 크기비교 연산자 좌항과 우항의 값을 비교하여 초과, 미만을 비교하여 참과 거짓을 반환 (보다 크다)
  echo "<br/>";
  echo $num < 11; // < 크기비교 연산자 좌항과 우항의 값을 비교하여 초과, 미만을 비교하여 참과 거짓을 반환 (보다 작다)
  echo "<br/>";
  echo $num >= 10; // >= 크기비교 연산자 좌항과 우항의 값을 비교하여 이상, 이하를 비교하여 참과 거짓을 반환 (같거나 크다)
  echo "<br/>";
  echo $num <= 10; // <= 크기비교 연산자 좌항과 우항의 값을 비교하여 이상, 이하를 비교하여 참과 거짓을 반환 (같거나 작다)
?>

